app/Http/Controllers/LibroController.php

select * from `libros` where `titulo` like '%prueba%' and `sinopsis` like '%%' and `sinopsis` like '%%' order by `id` asc limit 5 offset 0
select count(*) as aggregate from `libros` where `titulo` like '%prueba%' and `sinopsis` like '%%' and `sinopsis` like '%%'
---
    public function index(Request $request)
    {
        $titulo=$request->get('titulo');
        $sinopsis=$request->get('sinopsis');
        $pvp=$request->get('pvp');

        $libros=Libro::orderBy('id')
        ->titulo($titulo)
        ->sinopsis($sinopsis)
        ->pvp($pvp)
        ->paginate(5);